12/data/attachments/e1aff5351a85852e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_43330617-2f07-4ec0-9ef2-ead5f48dd75b</nif:username>
            <nif:friendToBeAdded>Shirley_four_Actions_3620_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>